#include <stdio.h>

#include "stm32f4xx_hal.h"
#include "__Main_Loop.hpp"
#include "..\_Objects_Definitions\__ObjectsDefinitions.hpp"

using namespace src;
using namespace std;


//------------------------------------------------------------------------------
//  Основной цикл приложения
//------------------------------------------------------------------------------

void MainLoop()
{
//------------------------------------------------------------------------------
  //  Низкоуровневая инициализация
//------------------------------------------------------------------------------
  //  Разрешение выходов буферов
  GPIOC->BSRR = BIT_14;
//------------------------------------------------------------------------------
//  Агрегация объектов
//  Определяется только при инициализации программы
//------------------------------------------------------------------------------
  
  mainMenu.addObserver( &menuEngine );  //  Объект menuEngine подписался на рассылку событий, объявленных в IControlCommands
 
  
//------------------------------------------------------------------------------
//  Основной цикл программы
//------------------------------------------------------------------------------
 while(1){
//  100 mls --------------------------------------------------------------------
    menuEngine.display();

   if (Timer100mls >16660){
//    menuEngine.display();
    rc.cycleHandler();
    menuEngine.setMenuValue("A");
    menuEngine.findAvailableElements(menuEngine.getMenuValue());  // Производит поиск доступных элементов меню на данном уровне меню

    printf("RC Message = %d\n", rc.rcDecoder.getMessage());
//    printf("uDc = %f\n", uDC.getValue());
    Timer100mls =0;
  }
//------------------------------------------------------------------------------
  
  }
}

