#include <stdio.h>

#include "stm32f4xx_hal.h"
#include "__Main_Loop.hpp"
#include "..\_Objects_Definitions\__ObjectsDefinitions.hpp"

using namespace src;
using namespace std;


//------------------------------------------------------------------------------
//  Основной цикл приложения
//------------------------------------------------------------------------------

void MainLoop()
{
//------------------------------------------------------------------------------
  //  Низкоуровневая инициализация
//------------------------------------------------------------------------------
  //  Разрешение выходов буферов
  GPIOC->BSRR = BIT_14;
//------------------------------------------------------------------------------
//  Агрегация объектов
//  Определяется только при инициализации программы
//------------------------------------------------------------------------------
  
  mainMenu.addObserver( &menuEngine );  //  Объект menuEngine подписался на рассылку событий, объявленных в IControlCommands
  
//------------------------------------------------------------------------------
//  Начальные условия
//------------------------------------------------------------------------------
  menuEngine.setMenuValue("");
 
//------------------------------------------------------------------------------
//  Основной цикл программы
//------------------------------------------------------------------------------
 while(1){

//  5 mls --------------------------------------------------------------------
   if (Timer5mls >83){
     Timer5mls =0;
     displayLed4Digit.display();
   }

//  100 mls --------------------------------------------------------------------
   if (Timer100mls >1666){
    Timer100mls =0;

   }

//  333 mls --------------------------------------------------------------------
   if (Timer333mls >5550){
     Timer333mls =0;
     rc.cycleHandler();
     menuEngine.cycleHandler();
   }
  
//------------------------------------------------------------------------------
  
  }
}

