//#####################################################################################
//	Файл				DisplayLedDecoder.cpp
//	Название:		Декодер на LED индикатор
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 июнь 5 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################


//#include "stm32f10x.h"
#include "__DisplayLedDecoder.hpp"
//#include "_Parameters.h"

using namespace src;


//-------------------------------------------------------------------------------------
//  Декодитрование символа на битовые составляющие индикатора
//-------------------------------------------------------------------------------------
void LedDecoder::decode (char symbol)
{
  switch(symbol){
    case 'A': {_segments.all = 0x77; } break;
    case 'B': {_segments.all = 0x7C; } break;
    case 'C': {_segments.all = 0x39; } break;
    case 'D': {_segments.all = 0x5E; } break;
    default:  {_segments.all = 0x40; } break;
  }

}



