//#####################################################################################
//	Файл				__MainMenu.cpp
//	Название:		Менеджер меню.
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 июнь 4 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#include "__MainMenu.hpp"

using namespace src;


//-------------------------------------------------------------------------------------
//  Методы интерфейса IObservable
//-------------------------------------------------------------------------------------

//  Добавление наблюдателя в список рассылки
void  MainMenu::addObserver (IControlCommands* observer)
{
  _observers.push_back(observer);
}

//  Удаление наблюдателя из списка рассылки
void  MainMenu::removeObserver (IControlCommands* observer)
{
  _observers.remove(observer);
}

//  Оповещение наблюдателей
/*void  MainMenu::notyfyObservers (void)
{
  for (list<IObserver*>::iterator it=_observers.begin(); it!=_observers.end(); it++){
    (*it)->handleEvent(_message);
  }
}*/

