//#####################################################################################
//	Файл				__IDisplayed.h
//	Название:		Интерфейс работы с дисплеем
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 20 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################

#ifndef IDISPLAYED_HPP
#define IDISPLAYED_HPP

#include "stdint.h"

#ifdef __cplusplus
 extern "C" {
#endif 

using namespace std;
   
namespace src{	    

//=====================================================================================
//  Интерфейс работы с дисплеем.
//  Это свойство наследует и реализует класс, где требуется отображение
//=====================================================================================
class IDisplayed{
  public:
//    virtual void setString (char* string) =0;
//    virtual void display (void) =0;
//    virtual void displayOff (void) =0;
    virtual void getString (char& string) =0;
    virtual void getIm (uint16_t im) =0;
};

}	// namespace src


#ifdef __cplusplus
}
#endif
#endif

