//#####################################################################################
//	Файл				__IDisplayed.h
//	Название:		Интерфейс работы с дисплеем
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 20 | Бабкин П.А	 		| Первый релиз
// 	-----|-------------|----------------|----------------------------------------------
//#####################################################################################


//=====================================================================================
//  Интерфейс работы с дисплеем.
//  Это свойство наследует и реализует класс, где требуется отображение
//=====================================================================================
class IDisplayed{
  public:
    void display (void);
    void displayOff (void);
};

