//#####################################################################################
//	Файл				__IMenuItem.h
//	Название:		Интерфейс обработки элемента меню
//	Автор:			Бабкин.П.А
//	Вер. | гггг-ммм-дд | Внес изменения | Описание изменений
//	=====|=============|================|==============================================
// 	 1.0 | 2015 май 28 | Бабкин П.А	 		| Первый релиз
//#####################################################################################


#ifndef IMENUITEM_H
#define IMENUITEM_H

#include "stdint.h"

#ifdef __cplusplus
 extern "C" {
#endif 

namespace src{	 

//=================================================================================================
//  Интерфейс, определяющий возможность взаимодействия как с элементом меню.
//=================================================================================================
class IMenuItem{
  public:
            void     putToMenu (IMenuItem* menuItem);   // Положить в меню элемент (объект IMenuItem)
     inline uint16_t getId     (void);       // Возвращает id параметра
     virtual inline char*    getMenu   (void) =0;     // Возвращает указатель на индекс меню
     inline char*    getText   (void);     // Возвращает указатель на текст меню
     inline uint8_t  getAccess (void);      // Возвращает уровень доступа
};  

} //src
#ifdef __cplusplus
}
#endif
#endif	//define IMENUITEM_H

